Documents/РСК_ОтчетПоВыдачеТСР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>РСК_ОтчетПоВыдачеТСР</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.РСК_СостояниеЗаказовКлиентовПоВыдаче</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контракт</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСдачиВФСС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Реестр</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Акт</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоручениеЭкспедитору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХарактеристикаНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТСР</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерНаправления</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заявитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДовЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>12</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Район</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНаправления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерРеестра</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаРеестра</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/РСК_СтатусыВыполненияКонтрактов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>РСК_СтатусыВыполненияКонтрактов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_СтатусыАктовВыдачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТСР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПолучательТСР</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНаправления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РСК_СтатусыАктовВыдачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РСК_СтатусыАктовВыдачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подготовлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отгружен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выдан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяЗамена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возврат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аннулирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОтчете</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/НоменклатураКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>НоменклатураКонтрагентов</Name>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.НоменклатураБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Характеристика</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ХарактеристикаНоменклатурыБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторХарактеристикиСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Недействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НаименованиеХарактеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Артикул</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Штрихкод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторУпаковки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоУпаковок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КоличествоБазовойЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>КодОКЕИБазовойЕдиницыИзмерения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторНоменклатуры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторХарактеристики</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ИдентификаторНоменклатурыСервиса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Упаковка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УпаковкаНоменклатурыБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДругиеШтрихкодыНоменклатуры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Штрихкод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>300</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Documents/РСК_ОтчетПоВыдачеТСР/Forms/ДобавлениеАктов/Ext/Form/Module.bsl
&НаСервере
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Параметры.Свойство("Контракт", Контракт);
	Параметры.Свойство("ДатаНачала", ПериодВыборки.ДатаНачала);
	Параметры.Свойство("ДатаОкончания", ПериодВыборки.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПриОткрытии(Отказ)
	Элементы.ПериодВыборки.Доступность = НЕ ВсеВыданныеПоКонтракту;
КонецПроцедуры

&НаСервере
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура СформироватьАктыНаСервере()
	ЗапросАкты = Новый Запрос;
	Если ВсеВыданныеПоКонтракту Тогда	
		ЗапросАкты.Текст = 
			"ВЫБРАТЬ
			|	ПоручениеЭкспедитору.Ссылка КАК Акт,
			|	ПоручениеЭкспедитору.Пункт КАК Заявитель,
			|	ПоручениеЭкспедитору.РСК_Номенклатура КАК Номенклатура,
			|	ПоручениеЭкспедитору.РСК_Характеристика КАК ХарактеристикаНоменклатуры,
			|	ПоручениеЭкспедитору.РСК_ТСР КАК ТСР,
			|	ПоручениеЭкспедитору.РСК_Количество КАК Количество,
			|	ПоручениеЭкспедитору.РСК_Цена КАК Цена,
			|	ПоручениеЭкспедитору.РСК_Сумма КАК Сумма,
			|	ПоручениеЭкспедитору.РСК_НомерНаправления КАК НомерНаправления,
			|	ПоручениеЭкспедитору.РСК_ДатаНаправления КАК ДатаНаправления,
			|	ПоручениеЭкспедитору.РСК_НомерРеестра КАК НомерРеестра,
			|	ПоручениеЭкспедитору.РСК_ДатаРеестра КАК ДатаРеестра
			|ИЗ
			|	Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
			|		ПО ПоручениеЭкспедиторуОснования.Ссылка = ПоручениеЭкспедитору.Ссылка
			|			И (ПоручениеЭкспедиторуОснования.НомерСтроки = 1)
			|ГДЕ
			|	ПоручениеЭкспедиторуОснования.Основание = &Контракт
			|	И ПоручениеЭкспедитору.РСК_СтатусАктаВыдачиТСР = ЗНАЧЕНИЕ(Перечисление.РСК_СтатусыАктовВыдачи.Выдан)
			|	И ПоручениеЭкспедитору.РСК_АктВыдачиТСР
			|	И НЕ ПоручениеЭкспедитору.ПометкаУдаления";
	Иначе
		ЗапросАкты.Текст = 
			"ВЫБРАТЬ
			|	ПоручениеЭкспедитору.Ссылка КАК Акт,
			|	ПоручениеЭкспедитору.Пункт КАК Заявитель,
			|	ПоручениеЭкспедитору.РСК_Номенклатура КАК Номенклатура,
			|	ПоручениеЭкспедитору.РСК_Характеристика КАК ХарактеристикаНоменклатуры,
			|	ПоручениеЭкспедитору.РСК_ТСР КАК ТСР,
			|	ПоручениеЭкспедитору.РСК_Количество КАК Количество,
			|	ПоручениеЭкспедитору.РСК_Цена КАК Цена,
			|	ПоручениеЭкспедитору.РСК_Сумма КАК Сумма,
			|	ПоручениеЭкспедитору.РСК_НомерНаправления КАК НомерНаправления,
			|	ПоручениеЭкспедитору.РСК_ДатаНаправления КАК ДатаНаправления,
			|	ПоручениеЭкспедитору.РСК_НомерРеестра КАК НомерРеестра,
			|	ПоручениеЭкспедитору.РСК_ДатаРеестра КАК ДатаРеестра
			|ИЗ
			|	Документ.ПоручениеЭкспедитору.Основания КАК ПоручениеЭкспедиторуОснования
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
			|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РСК_СтатусыВыполненияКонтрактов КАК РСК_СтатусыВыполненияКонтрактов
			|			ПО (РСК_СтатусыВыполненияКонтрактов.Регистратор = ПоручениеЭкспедитору.Ссылка)
			|		ПО ПоручениеЭкспедиторуОснования.Ссылка = ПоручениеЭкспедитору.Ссылка
			|			И (ПоручениеЭкспедиторуОснования.НомерСтроки = 1)
			|ГДЕ
			|	ПоручениеЭкспедиторуОснования.Основание = &Контракт
			|	И ПоручениеЭкспедитору.РСК_СтатусАктаВыдачиТСР = ЗНАЧЕНИЕ(Перечисление.РСК_СтатусыАктовВыдачи.Выдан)
			|	И ПоручениеЭкспедитору.РСК_АктВыдачиТСР
			|	И РСК_СтатусыВыполненияКонтрактов.ДатаЗаписи МЕЖДУ &ДатаНачала И &ДатаОкончания
			|	И РСК_СтатусыВыполненияКонтрактов.Статус = ЗНАЧЕНИЕ(Перечисление.РСК_СтатусыАктовВыдачи.Выдан)";
		
		ЗапросАкты.УстановитьПараметр("ДатаНачала",НачалоДня(ПериодВыборки.ДатаНачала));
		ЗапросАкты.УстановитьПараметр("ДатаОкончания",?(
			ЗначениеЗаполнено(ПериодВыборки.ДатаОкончания),
			КонецДня(ПериодВыборки.ДатаОкончания),
			'3999-12-31 23:59:59'
		));
	КонецЕсли;
	
	ЗапросАкты.УстановитьПараметр("Контракт",Контракт);
	Реестр.Загрузить(ЗапросАкты.Выполнить().Выгрузить());

КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура СформироватьАкты(Команда)
	Если НЕ ПроверитьЗаполнениеНаСервере() Тогда
		Возврат;
	КонецЕсли;
	
	Если Реестр.Количество()=0 Тогда
		СформироватьАктыНаСервере();
	Иначе
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПослеВопросаОПерезаполненииТаблицы", ЭтаФорма), 
			"Табличная часть заполнена, перезаполнить?",
			РежимДиалогаВопрос.ДаНет
		);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПослеВопросаОПерезаполненииТаблицы(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	СформироватьАктыНаСервере();

КонецПроцедуры

&НаСервере
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Функция ПроверитьЗаполнениеНаСервере()

	Возврат ПроверитьЗаполнение();

КонецФункции // ПроверитьЗаполнениеНаСервере()

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ВыбратьВсе(Команда)
	
	Для Каждого СтрокаТЧ ИЗ Реестр Цикл
		СтрокаТЧ.Выбран = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ОтменитьВсе(Команда)
	
	Для Каждого СтрокаТЧ ИЗ Реестр Цикл
		СтрокаТЧ.Выбран = Ложь;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура УдалитьНеотмеченные(Команда)
	
	сзСтрокиДляУдаления = Новый СписокЗначений;
	Для Каждого СтрокаТЧ ИЗ Реестр Цикл
		Если СтрокаТЧ.Выбран Тогда Продолжить; КонецЕсли;
		сзСтрокиДляУдаления.Добавить(СтрокаТЧ);
	КонецЦикла;
	Для Каждого СтрокаСписка Из сзСтрокиДляУдаления Цикл
		Реестр.Удалить(СтрокаСписка.Значение);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура Удалитьотмеченные(Команда)

	сзСтрокиДляУдаления = Новый СписокЗначений;
	Для Каждого СтрокаТЧ ИЗ Реестр Цикл
		Если НЕ СтрокаТЧ.Выбран Тогда Продолжить; КонецЕсли;
		сзСтрокиДляУдаления.Добавить(СтрокаТЧ);
	КонецЦикла;
	Для Каждого СтрокаСписка Из сзСтрокиДляУдаления Цикл
		Реестр.Удалить(СтрокаСписка.Значение);
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Функция ВыгрузитьНаСервере()
	Возврат ПоместитьВоВременноеХранилище(Реестр.Выгрузить(Новый Структура("Выбран", Истина)), Новый УникальныйИдентификатор);
КонецФункции

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПеренестиДанные(Команда)
	Закрыть(ВыгрузитьНаСервере());
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПоискПоАктуАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Элементы.Реестр.ОтборСтрок = Новый ФиксированнаяСтруктура("Акт",Текст);
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ПоискПоЗаявителюАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	Элементы.Реестр.ОтборСтрок = Новый ФиксированнаяСтруктура("Заявитель",Текст);
КонецПроцедуры

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура РеестрАктОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	РеквизитыАкта = ПолучитьРеквизитыАкта(ВыбранноеЗначение);
	ЗаполнитьЗначенияСвойств(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные, РеквизитыАкта);
КонецПроцедуры

&НаСервере
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Функция ПолучитьРеквизитыАкта(СсылкаАкт)
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоручениеЭкспедитору.Ссылка КАК Акт,
		|	ПоручениеЭкспедитору.Пункт КАК Заявитель,
		|	НоменклатураКонтрагентов.Номенклатура КАК Номенклатура,
		|	НоменклатураКонтрагентов.Характеристика КАК ХарактеристикаНоменклатуры,
		|	ПоручениеЭкспедитору.РСК_ТСР КАК ТСР,
		|	ПоручениеЭкспедитору.РСК_Количество КАК Количество,
		|	ПоручениеЭкспедитору.РСК_Цена КАК Цена,
		|	ПоручениеЭкспедитору.РСК_Сумма КАК Сумма,
		|	ПоручениеЭкспедитору.РСК_НомерНаправления КАК НомерНаправления,
		|	ПоручениеЭкспедитору.РСК_ДатаНаправления КАК ДатаНаправления,
		|	ПоручениеЭкспедитору.РСК_НомерРеестра КАК НомерРеестра,
		|	ПоручениеЭкспедитору.РСК_ДатаРеестра КАК ДатаРеестра
		|ИЗ
		|	Документ.ПоручениеЭкспедитору КАК ПоручениеЭкспедитору
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НоменклатураКонтрагентов КАК НоменклатураКонтрагентов
		|		ПО ПоручениеЭкспедитору.РСК_ТСР = НоменклатураКонтрагентов.Ссылка
		|ГДЕ
		|	ПоручениеЭкспедитору.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", СсылкаАкт);
	Возврат РСК_ВызовСервера.ЗапросВСтруктуру(Запрос);	
КонецФункции

&НаКлиенте
//++ РС Консалт: Трофимов Евгений 05.07.2022 Задача 17534
//e1cib/data/Документ.Задание?ref=a3eb9b03bd1c14b84aeaf2f6294e0848
Процедура ВсеВыданныеПоКонтрактуПриИзменении(Элемент)
	Элементы.ПериодВыборки.Доступность = НЕ ВсеВыданныеПоКонтракту;
КонецПроцедуры
